Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.SetDefaultValue Method
Overload List
Name | Description
SetDefaultValue(Double)
 Sets the default value of a double property.
SetDefaultValue(Int32)
 Sets the default value of an integer property.
SetDefaultValue(String)
 Sets the default value of a string property.
Top
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace